# CannotCopyDuplicates Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CopyPasteFailures..::..CannotCopyDuplicates Property
BuiltInFailures..::..CopyPasteFailures Class See Also
---
Can't paste duplicate types. Only non duplicate types will be pasted.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCopyDuplicates { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCopyDuplicates As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCopyDuplicates {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CopyPasteFailures Class
Autodesk.Revit.DB Namespace